; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-5-7)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	p1-0 - location
	p1-2 - location
	p2-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s2)
	(at driver3 s2)
	(at driver4 s0)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s1)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s2)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s1)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s2)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at package1 s1)
	(at package2 s2)
	(at package3 s2)
	(at package4 s0)
	(at package5 s0)
	(at package6 s2)
	(at package7 s0)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 19)
	(= (time-to-drive s1 s0) 19)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 40)
	(= (time-to-drive s2 s1) 40)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 83)
	(= (time-to-drive s0 s2) 83)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver4 s0)
	(at truck1 s2)
	(at truck2 s1)
	(at truck3 s2)
	(at truck4 s1)
	(at truck5 s1)
	(at package1 s2)
	(at package2 s0)
	(at package3 s2)
	(at package4 s1)
	(at package5 s2)
	(at package6 s2)
	(at package7 s0)
	))

(:metric minimize (+ (* 4 (total-time)) (* 1 (fuel-used))))

)

; plan
1. (board-truck driver2 truck5 s2)
   deleted: (at driver2 s2) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 7 of 13
2. (load-truck package2 truck5 s2)
   deleted: (at package2 s2)
   added: (in package2 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 7 of 13
3. (drive-truck truck5 s2 s0 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (fuel-used) from 0 to 913
   goals met: 7 of 13
4. (unload-truck package2 truck5 s0)
   deleted: (in package2 truck5)
   added: (at package2 s0)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 8 of 13
5. (board-truck driver1 truck1 s0)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 8 of 13
6. (load-truck package4 truck5 s0)
   deleted: (at package4 s0)
   added: (in package4 truck5)
   changed: (load truck5) from 0 to 1, (fuel-per-minute truck5) from 10 to 11
   goals met: 8 of 13
7. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (fuel-used) from 913 to 1743
   goals met: 9 of 13
8. (load-truck package5 truck5 s0)
   deleted: (at package5 s0)
   added: (in package5 truck5)
   changed: (load truck5) from 1 to 2, (fuel-per-minute truck5) from 11 to 13
   goals met: 9 of 13
9. (drive-truck truck5 s0 s1 driver2)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   changed: (fuel-used) from 1743 to 1990
   goals met: 10 of 13
10. (unload-truck package4 truck5 s1)
   deleted: (in package4 truck5)
   added: (at package4 s1)
   changed: (load truck5) from 2 to 1, (fuel-per-minute truck5) from 13 to 11
   goals met: 11 of 13
11. (load-truck package1 truck5 s1)
   deleted: (at package1 s1)
   added: (in package1 truck5)
   changed: (load truck5) from 1 to 2, (fuel-per-minute truck5) from 11 to 13
   goals met: 11 of 13
12. (drive-truck truck5 s1 s2 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   changed: (fuel-used) from 1990 to 2510
   goals met: 10 of 13
13. (unload-truck package1 truck5 s2)
   deleted: (in package1 truck5)
   added: (at package1 s2)
   changed: (load truck5) from 2 to 1, (fuel-per-minute truck5) from 13 to 11
   goals met: 11 of 13
14. (unload-truck package5 truck5 s2)
   deleted: (in package5 truck5)
   added: (at package5 s2)
   changed: (load truck5) from 1 to 0, (fuel-per-minute truck5) from 11 to 10
   goals met: 12 of 13
15. (drive-truck truck5 s2 s1 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   changed: (fuel-used) from 2510 to 2910
   goals met: 13 of 13
